ensemble.1

Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_2 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           40          input_2[0][0]
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 3)]          0
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 5)            55          dense_2[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 5)            30          dense_3[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            55          dense[0][0]
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 5)            30          dense_4[0][0]
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10)           0           dense_1[0][0]
                                                                 dense_5[0][0]
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 30)           330         concatenate[0][0]
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           310         dense_6[0][0]
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 10)           110         dense_7[0][0]
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 30)           330         dense_8[0][0]
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 30)           330         dense_8[0][0]
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 15)           465         dense_12[0][0]
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 7)            217         dense_9[0][0]
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 7)            112         dense_13[0][0]
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 3)            24          dense_10[0][0]
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 3)            24          dense_14[0][0]
====================================================================================

input 1쪽보다 2쪽이 층이 더 많고 병렬이라서 지그제그로 나옴
2개의 모델을 concatenate 하는거다보니 connected to 라고해서 어느층에서 이어진지 나옴
concatenate 에서는 이전 노드의 합으로 노드수가 유지되는듯 보여진다.
(3*10+10) + (10*5+5) + (3*10+10)+(5*5+5)+(10*5+5)+(5*5+5)+(10*30+30)+(30*10+10)+(10*10+10)+(10*30+30)+(10*30+30)+(30*15+15)+(30*7+7)+(15*7+7)+(7*3+3)+(7*3+3)
=2502

계산하는 방법은 파악했고 나머지 서머리요약표를 보고 암산해봄


Layer (type)                 Output Shape              Param #
=================================================================
dense (Dense)                (None, 5)                 10
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 18
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 16
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 5
=================================================================
Total params: 49
Trainable params: 49
Non-trainable params: 0
_________________________________________________________________



__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to       

==================================================================================================
input_2 (InputLayer)            [(None, 3)]          0

__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           40          input_2[0][0]      

__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, 3)]          0

__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 5)            55          dense_2[0][0]      

__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]      

__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 5)            30          dense_3[0][0]      

__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            55          dense[0][0]        

__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 5)            30          dense_4[0][0]      

__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 10)           0           dense_1[0][0]      

                                                                 dense_5[0][0]      

__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 30)           330         concatenate[0][0]  

__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 10)           310         dense_6[0][0]      

__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 10)           110         dense_7[0][0]      

__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 5)            55          dense_8[0][0]      

__________________________________________________________________________________________________
dense_10 (Dense)                (None, 3)            18          dense_9[0][0]      

==================================================================================================
Total params: 1,073
Trainable params: 1,073
Non-trainable params: 0
___________________________________________________________________________________


__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to       

==================================================================================================
input_1 (InputLayer)            [(None, 3)]          0

__________________________________________________________________________________________________
dense (Dense)                   (None, 10)           40          input_1[0][0]      

__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 5)            55          dense[0][0]        

__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 30)           180         dense_1[0][0]      

__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 30)           930         dense_2[0][0]      

__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 30)           930         dense_2[0][0]      

__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 15)           465         dense_6[0][0]      

__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 7)            217         dense_3[0][0]      

__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 7)            112         dense_7[0][0]      

__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 3)            24          dense_4[0][0]      

__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 3)            24          dense_8[0][0]      

==================================================================================================
Total params: 2,977
Trainable params: 2,977
Non-trainable params: 0
__________________________________________________________________________________________________


간단히 공식화 하면 이전노드수*현재노드수 + 현재노드수(wx+b)


layer의 name 이란 변수는 층에 이름을 포함시켜주는 파라미터인데 이렇게 서머리를 볼때 이해가 잘 안되고 한눈에 파악이 안되서
넣어주는 것으로 보임 선택사항이나 나중에 남이 코드를 볼때의 이해를 크게 도울것으로 추정 그러나 내가 넣기에는 귀찮은 파라미터...

반드시 써야할 때는 내 모델을 외부사람에게 보여줄때, 일듯

나중에 남이 만들어놓은 모델을 가져올때는 name으로 중복된 층을 피해야한다.